howto/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>How to use HotDrink</title>
<!-- 2015-03-04 Wed 18:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">How to use HotDrink</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. About this documentation</a></li>
<li><a href="#sec-2">2. List of documents</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About this documentation</h2>
<div class="outline-text-2" id="text-1">
<p>
The purpose of this document collection is to explain how to use the HotDrink
library.  It is not intended to showcase HotDrink, but rather to lay the
groundwork for a solid grasp of how to get the most out of the library.  Thus,
instead of beginning with the most interesting features of HotDrink, it begins
with fundamental concepts and works its way up from there.
</p>

<p>
Most chapters in these documents begin with a working example which
illustrates the new concepts of that chapter.  The rest of the chapter
explains why the example works, and gives any further information needed.
</p>

<p>
We use software to inject the source code of the example directly into the
how-to documents.  Thus, you can see the results of the example code
together with the code itself.  Note, however, that these examples will only
work if the file <a href="hotdrink.min.js"><code>hotdrink.min.js</code></a> is in the same directory as the how-to.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> List of documents</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="intro.html">Introduction to HotDrink</a> &#x2014; This document explains the basic concepts
behind HotDrink and how to include it in your web application.  You should
start here.
</li>

<li><a href="basics.html">Basic HotDrink Usage</a> &#x2014; This document explains the basics of using
HotDrink:  specifying a constraint system and binding to the view.  You
should read this second.
</li>

<li><a href="binding.html">Advanced Binding Concepts</a> &#x2014; This document goes into the binding system in
more depth:  customizing binders and creating your own.  Read this if you
need more control over how your data is displayed in the web page.
</li>

<li><a href="async.html">Asynchronous Methods</a> &#x2014; This document explains HotDrink's support for
asynchronous methods and how it can respond to unused values.  Read this if
you need to write methods which run asynchronously or perform asynchronous
server calls, or methods which may not use all of their inputs.
</li>

<li><a href="program.html">Programming Guide</a> &#x2014; This document explains programming idioms used by
HotDrink and gets you set up to write your own translators, view adapters
and asynchronous methods.  You should read this last, and only if the
default mechanisms provided by HotDrink are not cutting it for you.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-03-04 Wed 18:03</p>
<p class="validation"></p>
</div>
</body>
</html>
